In [2]:
import numpy as np
import pandas as pd

In [15]:
data = {
    'Name': ['John', 'shon', 'mono', 'sono'],
    'Age': [32, 45, 67, 54],
    'City': ['PCMC', 'LV', 'NYC', 'LA'],
    'Salary': [10000, 54000, 90000, 50000]
}
df = pd.DataFrame(data)
df

   Name  Age  City  Salary
0  John   32  PCMC   10000
1  shon   45    LV   54000
2  mono   67   NYC   90000
3  sono   54    LA   50000

In [22]:
data_list = [
    ['John', 23, 'NYC', 90000],
    ['Andre', 45, 'LA', 80000],
    ['Shaw', 43, 'PAris', 70000]
]
df2 = pd.DataFrame(data_list)
col_name = ['Name', 'Age', 'City', 'Salary']
df3 = pd.DataFrame(data_list, columns=col_name)
df3

    Name  Age   City  Salary
0   John   23    NYC   90000
1  Andre   45     LA   80000
2   Shaw   43  PAris   70000

In [27]:
df3[['Name', 'City', 'Salary']]

    Name   City  Salary
0   John    NYC   90000
1  Andre     LA   80000
2   Shaw  PAris   70000

In [52]:
df3["Dept"] = ["CS", "Entc", "Mech"]
df3

    Name  Age   City  Salary  Dept
0   John   23    NYC   90000    CS
1  Andre   45     LA   80000  Entc
2   Shaw   43  PAris   70000  Mech

In [53]:
df3.drop('Dept', axis=1)

    Name  Age   City  Salary
0   John   23    NYC   90000
1  Andre   45     LA   80000
2   Shaw   43  PAris   70000

In [54]:
df3.drop('Dept', axis=1, inplace=True)
df3

    Name  Age   City  Salary
0   John   23    NYC   90000
1  Andre   45     LA   80000
2   Shaw   43  PAris   70000

In [77]:
# df3.drop(["City", "Salary"], axis=1)
df3.drop(0, axis=0)

    Name  Age   City  Salary
1  Andre   45     LA   80000
2   Shaw   43  PAris   70000